app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @question = Question.find(params[:question_id])

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "answers" ("body", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "sdsdfdfsdsdgdfhghjfghdsfasdssfgfghdfgvccasxasxascf"], ["question_id", 1], ["created_at", 2017-01-10 00:35:12 UTC], ["updated_at", 2017-01-10 00:35:12 UTC]]
---
  def create
    @question = Question.find(params[:question_id])
    @answer = Answer.new(answer_params)
    @answer.question = @question

    if @answer.save