app/controllers/questions_controller.rb

  def index
    @questions = Question.order(updated_at: :desc)
---
SELECT "questions".* FROM "questions" ORDER BY "questions"."updated_at" DESC

  def show
    @question = Question.find(params[:id])
    @answers = @question.answers.order(:updated_at)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1 ORDER BY "answers"."updated_at" ASC  [["question_id", 1]]

  def create
    @question = Question.new(question_params)

    if @question.save
---
INSERT INTO "questions" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    @question = Question.find(params[:id])

    if @question.update(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "questions" SET "description" = $1, "updated_at" = $2 WHERE "questions"."id" = $3

  def destroy
    @question = Question.find(params[:id])
    @question.answers.destroy_all
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "answers" WHERE "answers"."id" = $1  [["id", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 1]]